; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-8-7-36)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	driver8 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	package31 - package
	package32 - package
	package33 - package
	package34 - package
	package35 - package
	package36 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-1 - location
	p0-2 - location
	p1-0 - location
	p1-3 - location
	p1-4 - location
	p2-0 - location
	p3-0 - location
	p3-1 - location
	p4-0 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s4)
	(at driver3 s3)
	(at driver4 s0)
	(at driver5 s1)
	(at driver6 s2)
	(at driver7 s3)
	(at driver8 s3)
	(at truck1 s4)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at truck5 s4)
	(empty truck5)
	(at truck6 s4)
	(empty truck6)
	(at truck7 s0)
	(empty truck7)
	(at package1 s1)
	(at package2 s1)
	(at package3 s4)
	(at package4 s4)
	(at package5 s0)
	(at package6 s4)
	(at package7 s1)
	(at package8 s3)
	(at package9 s0)
	(at package10 s2)
	(at package11 s1)
	(at package12 s4)
	(at package13 s2)
	(at package14 s0)
	(at package15 s3)
	(at package16 s0)
	(at package17 s3)
	(at package18 s1)
	(at package19 s0)
	(at package20 s3)
	(at package21 s2)
	(at package22 s1)
	(at package23 s2)
	(at package24 s4)
	(at package25 s2)
	(at package26 s0)
	(at package27 s0)
	(at package28 s3)
	(at package29 s3)
	(at package30 s4)
	(at package31 s2)
	(at package32 s3)
	(at package33 s4)
	(at package34 s0)
	(at package35 s0)
	(at package36 s1)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(link s1 s0)
	(link s0 s1)
	(link s1 s4)
	(link s4 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s1)
	(link s1 s2)
	(link s2 s3)
	(link s3 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s4)
	(link s4 s3)
)
	(:goal (and
	(at driver1 s3)
	(at driver2 s4)
	(at driver3 s1)
	(at driver7 s4)
	(at driver8 s0)
	(at truck2 s3)
	(at truck3 s1)
	(at truck4 s0)
	(at truck5 s4)
	(at truck6 s0)
	(at truck7 s1)
	(at package1 s4)
	(at package2 s2)
	(at package3 s1)
	(at package4 s0)
	(at package5 s0)
	(at package6 s2)
	(at package7 s2)
	(at package8 s2)
	(at package9 s1)
	(at package10 s1)
	(at package11 s3)
	(at package12 s4)
	(at package13 s4)
	(at package14 s4)
	(at package15 s0)
	(at package17 s0)
	(at package18 s3)
	(at package19 s4)
	(at package20 s2)
	(at package21 s3)
	(at package22 s2)
	(at package23 s4)
	(at package24 s0)
	(at package25 s4)
	(at package26 s4)
	(at package27 s2)
	(at package28 s4)
	(at package29 s4)
	(at package30 s3)
	(at package31 s0)
	(at package32 s2)
	(at package33 s4)
	(at package34 s3)
	(at package35 s1)
	(at package36 s1)
	))


)

; plan
1. (board-truck driver4 s0 truck7)
   deleted: (at driver4 s0) (empty truck7)
   added: (driving driver4 truck7)
   goals met: 8 of 46
2. (load-truck s4 package30 truck1)
   deleted: (at package30 s4)
   added: (in package30 truck1)
   goals met: 8 of 46
3. (board-truck driver2 s4 truck1)
   deleted: (at driver2 s4) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 7 of 46
4. (drive-truck driver2 s4 s3 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   goals met: 7 of 46
5. (load-truck s3 package8 truck1)
   deleted: (at package8 s3)
   added: (in package8 truck1)
   goals met: 7 of 46
6. (load-truck s3 package32 truck1)
   deleted: (at package32 s3)
   added: (in package32 truck1)
   goals met: 7 of 46
7. (unload-truck s3 package30 truck1)
   deleted: (in package30 truck1)
   added: (at package30 s3)
   goals met: 8 of 46
8. (load-truck s3 package29 truck1)
   deleted: (at package29 s3)
   added: (in package29 truck1)
   goals met: 8 of 46
9. (drive-truck driver2 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 8 of 46
10. (load-truck s4 package6 truck1)
   deleted: (at package6 s4)
   added: (in package6 truck1)
   goals met: 8 of 46
11. (drive-truck driver2 s4 s1 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   goals met: 8 of 46
12. (load-truck s1 package7 truck1)
   deleted: (at package7 s1)
   added: (in package7 truck1)
   goals met: 8 of 46
13. (load-truck s1 package22 truck1)
   deleted: (at package22 s1)
   added: (in package22 truck1)
   goals met: 8 of 46
14. (drive-truck driver2 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 8 of 46
15. (drive-truck driver4 s0 s1 truck7)
   deleted: (at truck7 s0)
   added: (at truck7 s1)
   goals met: 9 of 46
16. (unload-truck s2 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s2)
   goals met: 10 of 46
17. (unload-truck s2 package7 truck1)
   deleted: (in package7 truck1)
   added: (at package7 s2)
   goals met: 11 of 46
18. (unload-truck s2 package6 truck1)
   deleted: (in package6 truck1)
   added: (at package6 s2)
   goals met: 12 of 46
19. (unload-truck s2 package32 truck1)
   deleted: (in package32 truck1)
   added: (at package32 s2)
   goals met: 13 of 46
20. (load-truck s2 package31 truck1)
   deleted: (at package31 s2)
   added: (in package31 truck1)
   goals met: 13 of 46
21. (drive-truck driver2 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 13 of 46
22. (load-truck s0 package9 truck1)
   deleted: (at package9 s0)
   added: (in package9 truck1)
   goals met: 13 of 46
23. (load-truck s0 package35 truck1)
   deleted: (at package35 s0)
   added: (in package35 truck1)
   goals met: 13 of 46
24. (load-truck s0 package34 truck1)
   deleted: (at package34 s0)
   added: (in package34 truck1)
   goals met: 13 of 46
25. (drive-truck driver2 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 13 of 46
26. (load-truck s2 package25 truck1)
   deleted: (at package25 s2)
   added: (in package25 truck1)
   goals met: 13 of 46
27. (drive-truck driver2 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 13 of 46
28. (drive-truck driver2 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 13 of 46
29. (load-truck s4 package4 truck1)
   deleted: (at package4 s4)
   added: (in package4 truck1)
   goals met: 13 of 46
30. (load-truck s4 package3 truck1)
   deleted: (at package3 s4)
   added: (in package3 truck1)
   goals met: 13 of 46
31. (unload-truck s4 package29 truck1)
   deleted: (in package29 truck1)
   added: (at package29 s4)
   goals met: 14 of 46
32. (unload-truck s4 package25 truck1)
   deleted: (in package25 truck1)
   added: (at package25 s4)
   goals met: 15 of 46
33. (drive-truck driver2 s4 s3 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   goals met: 15 of 46
34. (drive-truck driver2 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 15 of 46
35. (unload-truck s0 package4 truck1)
   deleted: (in package4 truck1)
   added: (at package4 s0)
   goals met: 16 of 46
36. (unload-truck s0 package31 truck1)
   deleted: (in package31 truck1)
   added: (at package31 s0)
   goals met: 17 of 46
37. (drive-truck driver2 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 17 of 46
38. (load-truck s2 package23 truck1)
   deleted: (at package23 s2)
   added: (in package23 truck1)
   goals met: 17 of 46
39. (unload-truck s2 package22 truck1)
   deleted: (in package22 truck1)
   added: (at package22 s2)
   goals met: 18 of 46
40. (drive-truck driver2 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 18 of 46
41. (load-truck s0 package27 truck1)
   deleted: (at package27 s0)
   added: (in package27 truck1)
   goals met: 18 of 46
42. (drive-truck driver2 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 18 of 46
43. (unload-truck s2 package27 truck1)
   deleted: (in package27 truck1)
   added: (at package27 s2)
   goals met: 19 of 46
44. (drive-truck driver2 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 19 of 46
45. (drive-truck driver2 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 19 of 46
46. (load-truck s4 package24 truck1)
   deleted: (at package24 s4)
   added: (in package24 truck1)
   goals met: 19 of 46
47. (unload-truck s4 package23 truck1)
   deleted: (in package23 truck1)
   added: (at package23 s4)
   goals met: 20 of 46
48. (board-truck driver6 s2 truck3)
   deleted: (at driver6 s2) (empty truck3)
   added: (driving driver6 truck3)
   goals met: 20 of 46
49. (load-truck s2 package21 truck3)
   deleted: (at package21 s2)
   added: (in package21 truck3)
   goals met: 20 of 46
50. (drive-truck driver6 s2 s3 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   goals met: 20 of 46
51. (load-truck s3 package28 truck3)
   deleted: (at package28 s3)
   added: (in package28 truck3)
   goals met: 20 of 46
52. (unload-truck s3 package21 truck3)
   deleted: (in package21 truck3)
   added: (at package21 s3)
   goals met: 21 of 46
53. (load-truck s3 package20 truck3)
   deleted: (at package20 s3)
   added: (in package20 truck3)
   goals met: 21 of 46
54. (drive-truck driver6 s3 s2 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   goals met: 21 of 46
55. (unload-truck s2 package20 truck3)
   deleted: (in package20 truck3)
   added: (at package20 s2)
   goals met: 22 of 46
56. (load-truck s2 package13 truck3)
   deleted: (at package13 s2)
   added: (in package13 truck3)
   goals met: 22 of 46
57. (drive-truck driver6 s2 s1 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   goals met: 23 of 46
58. (drive-truck driver4 s1 s0 truck7)
   deleted: (at truck7 s1)
   added: (at truck7 s0)
   goals met: 22 of 46
59. (load-truck s1 package2 truck3)
   deleted: (at package2 s1)
   added: (in package2 truck3)
   goals met: 22 of 46
60. (load-truck s1 package18 truck3)
   deleted: (at package18 s1)
   added: (in package18 truck3)
   goals met: 22 of 46
61. (load-truck s1 package11 truck3)
   deleted: (at package11 s1)
   added: (in package11 truck3)
   goals met: 22 of 46
62. (drive-truck driver6 s1 s4 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s4)
   goals met: 21 of 46
63. (drive-truck driver2 s4 s1 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   goals met: 21 of 46
64. (unload-truck s1 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s1)
   goals met: 22 of 46
65. (unload-truck s1 package35 truck1)
   deleted: (in package35 truck1)
   added: (at package35 s1)
   goals met: 23 of 46
66. (unload-truck s1 package3 truck1)
   deleted: (in package3 truck1)
   added: (at package3 s1)
   goals met: 24 of 46
67. (load-truck s1 package1 truck1)
   deleted: (at package1 s1)
   added: (in package1 truck1)
   goals met: 24 of 46
68. (drive-truck driver2 s1 s4 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   goals met: 24 of 46
69. (disembark-truck driver2 s4 truck1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s4) (empty truck1)
   goals met: 25 of 46
70. (unload-truck s4 package1 truck1)
   deleted: (in package1 truck1)
   added: (at package1 s4)
   goals met: 26 of 46
71. (drive-truck driver6 s4 s3 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s3)
   goals met: 26 of 46
72. (unload-truck s3 package18 truck3)
   deleted: (in package18 truck3)
   added: (at package18 s3)
   goals met: 27 of 46
73. (load-truck s3 package17 truck3)
   deleted: (at package17 s3)
   added: (in package17 truck3)
   goals met: 27 of 46
74. (load-truck s3 package15 truck3)
   deleted: (at package15 s3)
   added: (in package15 truck3)
   goals met: 27 of 46
75. (unload-truck s3 package11 truck3)
   deleted: (in package11 truck3)
   added: (at package11 s3)
   goals met: 28 of 46
76. (drive-truck driver6 s3 s0 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   goals met: 28 of 46
77. (drive-truck driver4 s0 s1 truck7)
   deleted: (at truck7 s0)
   added: (at truck7 s1)
   goals met: 29 of 46
78. (load-truck s0 package26 truck3)
   deleted: (at package26 s0)
   added: (in package26 truck3)
   goals met: 29 of 46
79. (load-truck s0 package19 truck3)
   deleted: (at package19 s0)
   added: (in package19 truck3)
   goals met: 29 of 46
80. (drive-truck driver6 s0 s1 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   goals met: 30 of 46
81. (walk driver3 s3 p1-3)
   deleted: (at driver3 s3)
   added: (at driver3 p1-3)
   goals met: 30 of 46
82. (walk driver3 p1-3 s1)
   deleted: (at driver3 p1-3)
   added: (at driver3 s1)
   goals met: 31 of 46
83. (walk driver7 s3 p3-0)
   deleted: (at driver7 s3)
   added: (at driver7 p3-0)
   goals met: 31 of 46
84. (walk driver7 p3-0 s0)
   deleted: (at driver7 p3-0)
   added: (at driver7 s0)
   goals met: 31 of 46
85. (load-truck s0 package14 truck4)
   deleted: (at package14 s0)
   added: (in package14 truck4)
   goals met: 31 of 46
86. (walk driver8 s3 p3-0)
   deleted: (at driver8 s3)
   added: (at driver8 p3-0)
   goals met: 31 of 46
87. (walk driver8 p3-0 s0)
   deleted: (at driver8 p3-0)
   added: (at driver8 s0)
   goals met: 32 of 46
88. (walk driver7 s0 p4-0)
   deleted: (at driver7 s0)
   added: (at driver7 p4-0)
   goals met: 32 of 46
89. (walk driver7 p4-0 s4)
   deleted: (at driver7 p4-0)
   added: (at driver7 s4)
   goals met: 33 of 46
90. (board-truck driver2 s4 truck1)
   deleted: (at driver2 s4) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 32 of 46
91. (drive-truck driver2 s4 s3 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   goals met: 32 of 46
92. (unload-truck s3 package34 truck1)
   deleted: (in package34 truck1)
   added: (at package34 s3)
   goals met: 33 of 46
93. (drive-truck driver2 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 33 of 46
94. (unload-truck s0 package24 truck1)
   deleted: (in package24 truck1)
   added: (at package24 s0)
   goals met: 34 of 46
95. (drive-truck driver2 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 34 of 46
96. (load-truck s2 package10 truck1)
   deleted: (at package10 s2)
   added: (in package10 truck1)
   goals met: 34 of 46
97. (drive-truck driver2 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 34 of 46
98. (unload-truck s1 package10 truck1)
   deleted: (in package10 truck1)
   added: (at package10 s1)
   goals met: 35 of 46
99. (drive-truck driver2 s1 s4 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   goals met: 35 of 46
100. (disembark-truck driver2 s4 truck1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s4) (empty truck1)
   goals met: 36 of 46
101. (drive-truck driver6 s1 s4 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s4)
   goals met: 35 of 46
102. (unload-truck s4 package28 truck3)
   deleted: (in package28 truck3)
   added: (at package28 s4)
   goals met: 36 of 46
103. (drive-truck driver6 s4 s1 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s1)
   goals met: 37 of 46
104. (board-truck driver2 s4 truck2)
   deleted: (at driver2 s4) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 36 of 46
105. (board-truck driver8 s0 truck4)
   deleted: (at driver8 s0) (empty truck4)
   added: (driving driver8 truck4)
   goals met: 35 of 46
106. (board-truck driver7 s4 truck6)
   deleted: (at driver7 s4) (empty truck6)
   added: (driving driver7 truck6)
   goals met: 34 of 46
107. (drive-truck driver7 s4 s3 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s3)
   goals met: 34 of 46
108. (drive-truck driver7 s3 s0 truck6)
   deleted: (at truck6 s3)
   added: (at truck6 s0)
   goals met: 35 of 46
109. (disembark-truck driver7 s0 truck6)
   deleted: (driving driver7 truck6)
   added: (at driver7 s0) (empty truck6)
   goals met: 35 of 46
110. (walk driver7 s0 p4-0)
   deleted: (at driver7 s0)
   added: (at driver7 p4-0)
   goals met: 35 of 46
111. (walk driver7 p4-0 s4)
   deleted: (at driver7 p4-0)
   added: (at driver7 s4)
   goals met: 36 of 46
112. (drive-truck driver6 s1 s4 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s4)
   goals met: 35 of 46
113. (unload-truck s4 package26 truck3)
   deleted: (in package26 truck3)
   added: (at package26 s4)
   goals met: 36 of 46
114. (drive-truck driver6 s4 s1 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s1)
   goals met: 37 of 46
115. (drive-truck driver6 s1 s0 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   goals met: 36 of 46
116. (unload-truck s0 package17 truck3)
   deleted: (in package17 truck3)
   added: (at package17 s0)
   goals met: 37 of 46
117. (drive-truck driver6 s0 s1 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   goals met: 38 of 46
118. (drive-truck driver6 s1 s4 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s4)
   goals met: 37 of 46
119. (unload-truck s4 package19 truck3)
   deleted: (in package19 truck3)
   added: (at package19 s4)
   goals met: 38 of 46
120. (drive-truck driver6 s4 s1 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s1)
   goals met: 39 of 46
121. (drive-truck driver6 s1 s0 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   goals met: 38 of 46
122. (unload-truck s0 package15 truck3)
   deleted: (in package15 truck3)
   added: (at package15 s0)
   goals met: 39 of 46
123. (drive-truck driver6 s0 s1 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   goals met: 40 of 46
124. (drive-truck driver6 s1 s2 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   goals met: 39 of 46
125. (unload-truck s2 package2 truck3)
   deleted: (in package2 truck3)
   added: (at package2 s2)
   goals met: 40 of 46
126. (drive-truck driver6 s2 s1 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   goals met: 41 of 46
127. (drive-truck driver8 s0 s3 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s3)
   goals met: 40 of 46
128. (drive-truck driver8 s3 s4 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s4)
   goals met: 40 of 46
129. (unload-truck s4 package14 truck4)
   deleted: (in package14 truck4)
   added: (at package14 s4)
   goals met: 41 of 46
130. (disembark-truck driver2 s4 truck2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s4) (empty truck2)
   goals met: 42 of 46
131. (disembark-truck driver8 s4 truck4)
   deleted: (driving driver8 truck4)
   added: (at driver8 s4) (empty truck4)
   goals met: 42 of 46
132. (board-truck driver8 s4 truck2)
   deleted: (at driver8 s4) (empty truck2)
   added: (driving driver8 truck2)
   goals met: 42 of 46
133. (drive-truck driver8 s4 s3 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   goals met: 43 of 46
134. (drive-truck driver6 s1 s4 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s4)
   goals met: 42 of 46
135. (unload-truck s4 package13 truck3)
   deleted: (in package13 truck3)
   added: (at package13 s4)
   goals met: 43 of 46
136. (drive-truck driver6 s4 s1 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s1)
   goals met: 44 of 46
137. (board-truck driver7 s4 truck4)
   deleted: (at driver7 s4) (empty truck4)
   added: (driving driver7 truck4)
   goals met: 43 of 46
138. (drive-truck driver7 s4 s3 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s3)
   goals met: 43 of 46
139. (drive-truck driver7 s3 s0 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s0)
   goals met: 44 of 46
140. (disembark-truck driver7 s0 truck4)
   deleted: (driving driver7 truck4)
   added: (at driver7 s0) (empty truck4)
   goals met: 44 of 46
141. (walk driver7 s0 p4-0)
   deleted: (at driver7 s0)
   added: (at driver7 p4-0)
   goals met: 44 of 46
142. (walk driver7 p4-0 s4)
   deleted: (at driver7 p4-0)
   added: (at driver7 s4)
   goals met: 45 of 46
143. (disembark-truck driver8 s3 truck2)
   deleted: (driving driver8 truck2)
   added: (at driver8 s3) (empty truck2)
   goals met: 45 of 46
144. (walk driver8 s3 p3-0)
   deleted: (at driver8 s3)
   added: (at driver8 p3-0)
   goals met: 45 of 46
145. (walk driver8 p3-0 s0)
   deleted: (at driver8 p3-0)
   added: (at driver8 s0)
   goals met: 46 of 46
